Repository: desdobrasoft/Sistema-Balneario
Catalog: tech_wall/frontend/lib/src/localization/app_*.arb
Languages: pt

# loginUsernameLabel
source: User
pt: Usuário

# loginUsernameHint
source: exemple@email.com
pt: exemplo@email.com

# loginUsernameError
source: User is required
pt: O usuário é obrigatório

# loginPasswordLabel
source: Password
pt: Senha

# loginPasswordError
source: Password is required
pt: A senha é obrigatória

# homeNavigationDashboardLabel
source: Dashboard
pt: Painel

# homeNavigationCustomersLabel
source: Customers
pt: Clientes

# homeNavigationCatalogLabel
source: House Catalog
pt: Catálogo de Modelos

# homeNavigationSalesRecordLabel
source: Sales Record
pt: Registro de Vendas

# homeNavigationProgressLabel
source: Assembly Progress
pt: Ordens de Produção

# homeNavigationDeliveryLabel
source: Delivery Management
pt: Gerenciamento de Entregas

# homeNavigationFinanceLabel
source: Finance
pt: Financeiro/Compras

# homeNavigationStockLabel
source: Stock
pt: Estoque

# homeNavigationSettingsLabel
source: Settings
pt: Configurações

# tableActionsLabel
source: Actions
pt: Ações

# dashboardTotalSalesCardTitle
source: Total Sales
pt: Vendas Totais

# dashboardTotalSalesCardSubtitle
source: Performance in the last 6 months.
pt: Desempenho dos últimos 6 meses

# dashboardActiveProdsCardTitle
source: Active Productions
pt: Produções Ativas

# dashboardActiveProdsCardSubtitle
source: Currently active projects.
pt: Projetos atuais em andamento

# dashboardAvgDeliveryTimeCardTitle
source: Average Delivery Time
pt: Tempo Médio de Entrega

# dashboardAvgDeliveryTimeCardSubtitle
source: Average for finished orders.
pt: Média para pedidos concluídos

# dashboardMonthlyOverviewCardTitle
source: Monthly Sales Overview
pt: Visão Geral Mensal de Vendas

# dashboardMonthlyOverviewCardSubtitle
source: Monthly revenue.
pt: Receita gerada por mês

# dashboardProdStatusCardTitle
source: Order Status
pt: Status da Produção

# dashboardProdStatusCardSubtitle
source: Orders per stage.
pt: Distribuição dos status atuais dos projetos

# dashboardDeliveryTimeAnalysisCardTitle
source: Delivery Time Analysis
pt: Análise do Tempo de Entrega

# dashboardDeliveryTimeAnalysisCardSubtitle
source: Analysis of delivery time for each finished order.
pt: Distribuição das durações de entrega

# customersCardTitle
source: Customers Management
pt: Gerenciamento de Clientes

# customersCardSubtitle
source: View, add, edit or remove client records.
pt: Visualize, adicione, edite ou remova registros de clientes

# customersAddButtonLabel
source: Add client
pt: Adicionar cliente

# customerTableNameLabel
source: Name
pt: Nome

# customerTablePhoneLabel
source: Phone
pt: Telefone

# customerTableAddressLabel
source: Address
pt: Endereço

# customerTableSalesLabel
source: Sales
pt: Vendas

# customerFilterLabel
source: Search customer
pt: Buscar cliente

# customerFilterHint
source: John Smith
pt: João da Silva

# catalogCardTitle
source: House Model Catalog
pt: Catálogo de Modelos de Casas

# catalogCardSubtitle
source: Browse premade house models. The main difference is the area and kit components.
pt: Navegue pelos modelos de casas pré-fabricadas. A diferença principal é a área e os componentes do kit.

# catalogAddButtonLabel
source: Add model
pt: Adicionar modelo

# catalogMaterialListLabel
source: Kit materials categories
pt: Categorias de materiais do kit

# catalogBuildTimeLabel
source: Kit setup
pt: Preparo do Kit
